app/views/loans/_form.html.erb

  <div class="form-group">
    <% usuario = User.all.map { |user| [user.email, user.id] } %>
---
SELECT "users".* FROM "users"