app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "isbn", "published_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "334"], ["author", "3123"], ["isbn", "1312"], ["published_at", "2020-11-05"], ["created_at", "2020-11-16 16:00:08.500161"], ["updated_at", "2020-11-16 16:00:08.500161"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "author" = ?, "isbn" = ?, "published_at" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["author", ""], ["isbn", ""], ["published_at", "2020-11-20"], ["updated_at", "2020-11-16 18:32:12.499741"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)