app/controllers/loans_controller.rb

  def index
    @loans = Loan.all
---
SELECT "loans".* FROM "loans"

  def new
    @loan = Loan.new
    @books = Book.all
    @users = User.all
---
SELECT "books".* FROM "books"
SELECT "users".* FROM "users"

  def create
    @loan = Loan.new(loan_params)

    respond_to do |format|
      if @loan.save
---
INSERT INTO "loans" ("book_id", "user_id", "created_at", "updated_at", "status", "loan_start", "loan_end", "gave_loan", "received_loan") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @loan.update(loan_params)
---
UPDATE "loans" SET "loan_end" = ?, "status" = ?, "received_loan" = ?, "updated_at" = ? WHERE "loans"."id" = ?  [["loan_end", "2020-11-19"], ["status", "En Curso"], ["received_loan", ""], ["updated_at", "2020-11-17 02:29:04.959203"], ["id", 6]]

  def destroy
    @loan.destroy
---
DELETE FROM "loans" WHERE "loans"."id" = ?  [["id", 7]]

    def set_loan
      @loan = Loan.find(params[:id])
---
SELECT "loans".* FROM "loans" WHERE "loans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]