app/controllers/loans_controller.rb

  def edit
    @status_librarian = ['Reservado','Entregado','Cancelado','Finalizado']
    @users_availables = User.all.select { |user| user.valid_amount_of_loans? }
    @user_list = @users_availables.map { |user| [user.email, user.id] }
    @user_loan = Loan.find(params[:id])
    if @user_list.include? @user_loan
      @user_edit_list = @users_availables.map { |user| [user.email, user.id] }
    else
      @user_edit_list = @user_list.unshift([@user_loan.user.email, @user_loan.user_id]).uniq
    end
    @books_availables = Book.all.select { |book| book.loans? }
---
SELECT "users".* FROM "users"
SELECT "loans".* FROM "loans" WHERE "loans"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "books".* FROM "books"

  def update
    respond_to do |format|
      if @loan.update(loan_params)
---
UPDATE "loans" SET "book_id" = ?, "updated_at" = ? WHERE "loans"."id" = ?  [["book_id", 17], ["updated_at", "2020-12-03 23:11:27.143374"], ["id", 2]]

    def set_loan
      @loan = Loan.find(params[:id])
---
SELECT "loans".* FROM "loans" WHERE "loans"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]