app/models/book.rb

SELECT 1 AS one FROM "loans" WHERE "loans"."book_id" = ? LIMIT ?  [["book_id", 1], ["LIMIT", 1]]
---
    def loans?
        self.loans.empty?